In [65]:
# Import dependencies
import pandas as pd
import matplotlib.pyplot as plt

In [66]:
# Set csv paths
city_path = 'raw_data/city_data.csv'
ride_path = 'raw_data/ride_data.csv'

In [67]:
# Read city csv
city_df = pd.read_csv(city_path)
city_df = city_df.sort_values(by='city')
city_df.head()

            city  driver_count      type
65  Alvarezhaven            21     Urban
18    Alyssaberg            67     Urban
94    Anitamouth            16  Suburban
53  Antoniomouth            21     Urban
43  Aprilchester            49     Urban

In [68]:
# Check column counts
city_df.count()

city            126
driver_count    126
type            126
dtype: int64

In [69]:
# Check unique cities
len(city_df['city'].unique())

125

In [70]:
# Show duplicate cities
city_df[city_df['city'].duplicated(keep=False)]

           city  driver_count      type
84   Port James            15  Suburban
100  Port James             3  Suburban

In [80]:
# Group by city to consolidate Port James
group_city = city_df.groupby(['city'])

# Grab driver count sum for each city
driver_count = group_city['driver_count'].sum()

# Create data city dataframe
unique_city_df = pd.DataFrame({'driver_count': driver_count})

# Reset index
unique_city_df = unique_city_df.reset_index()
unique_city_df.head()

           city  driver_count
0  Alvarezhaven            21
1    Alyssaberg            67
2    Anitamouth            16
3  Antoniomouth            21
4  Aprilchester            49

In [85]:
# Merge to add city type to unique city dataframe
new_city_df = pd.merge(unique_city_df, city_df, on='city')

# Drop driver count column from city df (driver_count_y)
new_city_df = new_city_df[['city', 'driver_count_x', 'type']]

# Rename driver_count_x column
new_city_df = new_city_df.rename(columns={'driver_count_x': 'driver_count'})
new_city_df.head()

           city  driver_count      type
0  Alvarezhaven            21     Urban
1    Alyssaberg            67     Urban
2    Anitamouth            16  Suburban
3  Antoniomouth            21     Urban
4  Aprilchester            49     Urban

In [86]:
# Read ride csv
ride_df = pd.read_csv(ride_path)
ride_df.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [87]:
# Check column counts
ride_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [90]:
# Merge with left join to create pyber dataframe
pyber_df = pd.merge(ride_df, new_city_df, how='left')
pyber_df.head()

          city                 date   fare        ride_id  driver_count   type
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038            46  Urban
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942            35  Urban
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587            55  Urban
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892            68  Urban
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673             8  Urban

# Bubble Plot of Ride Sharing Data

In [100]:
# Group by city
group_pyber = pyber_df.groupby(['city'])

# Grab mean fare for each city
avg_fare = group_pyber['fare'].mean()

# Grab count of rides for each city
total_ride = group_pyber['ride_id'].count()

# Create dataframe from group by object
fare_ride = pd.DataFrame({'avg_fare': avg_fare, 'total_ride_count': total_ride})

# Reset index
fare_ride = fare_ride.reset_index()
fare_ride.head()

           city   avg_fare  total_ride_count
0  Alvarezhaven  23.928710                31
1    Alyssaberg  20.609615                26
2    Anitamouth  37.315556                 9
3  Antoniomouth  23.625000                22
4  Aprilchester  21.981579                19

In [103]:
# Merge with new city df
city_summary = pd.merge(fare_ride, new_city_df, how='left')
city_summary.head()

           city   avg_fare  total_ride_count  driver_count      type
0  Alvarezhaven  23.928710                31            21     Urban
1    Alyssaberg  20.609615                26            67     Urban
2    Anitamouth  37.315556                 9            16  Suburban
3  Antoniomouth  23.625000                22            21     Urban
4  Aprilchester  21.981579                19            49     Urban